cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "microsoft-azure-storage-explorer"
cask "vlc"
cask "wireshark"
cask "gimp"
cask "teamviewer"
#cask "microsoft-powerpoint"
#cask "microsoft-word"
#cask "microsoft-teams"
#cask "microsoft-excel"
cask "jetbrains-toolbox"
cask "datagrip"
cask "spotify"
cask "docker"
cask "dotnet"
cask "postman"
cask "iterm2"

# System
brew "zsh-completions"
brew "mas"
brew "curl"
brew "wget"

#REPLACE some of MAC own utils
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"

brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "nmap"
brew "rlwrap"


# Ops
brew "azure-cli"
brew "awscli"
brew "terraform"
brew "vault"
brew "kubeval"
brew "kubectx"


# Images and Audio
brew "imagemagick"
brew "ffmpeg"

# Archive & Git
brew "gh"
brew "xz"
brew "git"
brew "git-lfs"
brew "tig"


# JSON
brew "jq"
brew "jo"

# Dev
brew "yarn"
brew "python@3.8"
brew "go"
brew "openjdk"
brew "kind"
brew "node"


#language specific
#Go
brew "golangci-lint"
#Node 
brew "nvm"
#Os 
brew "direnv"

# App Store
# mas "uBlock", id: 1385985095

